TestingTool_3-0/src/Catalogs/НаборыТестов/НаборыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыТестов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезНаименования</name>
      <description>Без наименования</description>
    </items>
  </predefined>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНабора</name>
    <type>
      <types>EnumRef.ВидыНаборов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Enums/ВидыНаборов/ВидыНаборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНаборов</name>
  <enumValues>
    <name>ВнешнийКаталогGIT</name>
  </enumValues>
  <enumValues>
    <name>СписокФайлов</name>
  </enumValues>
  <enumValues>
    <name>СписокТестов</name>
  </enumValues>
</mdclass:Enum>

TestingTool_3-0/src/Catalogs/НаборыТестов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа=Ложь Тогда
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовыйОбъект = ЭтоНовый();
	
	ДополнительныеСвойства.Вставить("ЭтоНовыйОбъект", ЭтоНовыйОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидНабора<>Перечисления.ВидыНаборов.ВнешнийКаталогGIT Тогда
		ПутьКаталог = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
